# Алгоритми опрацювання табличних величин: 
# знаходження суми значень елементів; суми або кількості значень 
# елементів, що задовольняють заданим умовам.

# створення списку 
a = [1, 2, "Hello", True]

# цикл опрацювання кожного елементу списка
for i in a:
    print(i)

# конструкція генерації списку
# b = [1, 2, 3, 4]
# for i in range(5, 101):
#     b.append(i)

# list comprehension - вираз що динамічно створює список
b = [ i for i in range(1, 101) ]
print(b)

# рахування суми елементів
print(sum(b))

# 1. сума елементів що задовільняють певним умовам:
# сумму парних елементів масива

# 1.1
pairs_elems = []
for i in b:
    if i % 2 == 0:
        pairs_elems.append(i)
print(sum(pairs_elems))

# 1.2
print(sum(list(filter(lambda n: n % 2 == 0, b))))


# 2. сума кількості елементів що задовільняють певним умовам:
# перші 10 елементів або останні 20

x = b[:10]
print(sum(x))

y = b[-20:]
print(sum(y))
