a = [
     [7, 6, 5, 8, 9],
     [14, 21, 43, 4, 16]
]

# for row in a:
#     for elem in row:
#         if elem == 16:
#             print("Елемент 16 знайдено в заданому масиві.")

found = False  # Ініціалізуємо змінну для відстеження того, знайшли ми елемент чи ні

for row in a:
    for element in row:
        if element == 16:
            found = True  # Змінюємо статус на знайдено
            break  # Вихід з циклу якщо знайдено елемент
    if found:
        break  # Вихід з зовнішнього циклу якщо знайдено елемент

if found:
    print("Знайдено елемент 16 в масиві")
else:
    print("Елемент 16 не знайдено в масиві")